# CTE

A common table expression is a named temporary result set that exists only within the execution scope of a single SQL statement e.g.,SELECT, INSERT, UPDATE, or DELETE.

The basic syntax of a CTE is as follows:

```mysql
WITH cte_name (column_list) AS (
    # a query
)
# a query referencing to cte_name
```

(column_list) is optional. The number of columns in column_list should be the same as that in the query, but they don't have the same names. The column names of the cte is those in column_list. If (column_list) is not given, the column names of the query inside the cte are used.


```mysql
WITH ctl AS (
    ...
)
SELECT ... 
FROM tbl INNER JOIN ctl USING (x);
```

Multiple CTEs can be used in the same query.

```mysql
WITH ctl1 AS (
    # a query
),
ctl2 AS (
    # a query referencing to ctl1
) 
# a query referencing to ctl1 and/or ctl2 
```

## Recursive CTE

A CTE can be recursive:

```mysql
WITH RECURSIVE cte_name AS (
    # initial query called the anchor member
    UNION ALL # or UNION DISTINCT
    # a query referencing to cte_name, called the recursive member
)
# a query referencing to cte_name
```

The recursive member 

* should have a condition stopping the recursion,

* cannot contain aggregate functions, GROUP BY, ORDER BY, and LIMIT, 

* cannot contain DISTINCT if UNION ALL is used,

* can reference the cte only once and in its FROM clause.



The following example uses a recursive CTE generating a row sequentially and unioning all.

```mysql
WITH RECURSIVE cte_count (n) 
AS (
      SELECT 1
      UNION ALL
      SELECT n + 1 
      FROM cte_count 
      WHERE n < 3              # A termination condition is necessary.
    )
SELECT n 
FROM cte_count;

+------+
| n    |
+------+
|    1 |
|    2 |
|    3 |
+------+
```


Assume that we have a table named tree. id and pid (parent id) are among the columns of the table. Each row in the table corresponds to a node in a tree structure. The pid of the root node is NULL. We want to create a query showing id, pid, and depth in ascending order of depth, where depth is the depth of a node (1 for the root node, 2 for the children nodes of the root node, and so on).

Plan:

1. Create the root node: (id, pid=NULL, depth=1)

2. Assume the current cte contains all records with depth=k. To construct the next cte containing all records with depth=k+1, we join the current cte with tree on tree.pid = cte.id

```mysql
WITH RECURSIVE cte AS (
  SELECT id, pid, 1 depth FROM tree WHERE pid IS NULL
  UNION ALL
  SELECT t.id, t.pid, depth+1 FROM tree AS t INNER JOIN cte ON cte.id = t.pid)
SELECT id, pid, depth
FROM cte
ORDER BY depth;
```

An example from https://www.mysqltutorial.org/mysql-recursive-cte/ is as follows:

```mysql
WITH RECURSIVE employee_paths AS (
    SELECT employeeNumber, # id
           reportsTo managerNumber, # pid
           officeCode,   # will be used when we join the cte with another table
           1 lvl    # depth
    FROM employees
    WHERE reportsTo IS NULL
    UNION ALL
    SELECT e.employeeNumber, e.reportsTo, e.officeCode, lvl+1
    FROM employees e INNER JOIN employee_paths ep ON ep.employeeNumber = e.reportsTo)
SELECT employeeNumber, managerNumber, lvl, city
FROM employee_paths ep INNER JOIN offices o USING (officeCode)
ORDER BY lvl, city;
```

# Function

Use DECLARE to define local variables. If we define something using SET in a function or procedure, it is not a local variable. 

```mysql
CREATE FUNCTION city_pop(city_name CHAR(35), country_code CHAR(3))
RETURNS INT READS SQL DATA
BEGIN
  DECLARE pop INT;
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET pop = 0;
  SELECT Population INTO pop FROM world.city 
  WHERE CountryCode = country_code AND Name = city_name;
  RETURN pop;
END

SELECT city_pop('Chicago', 'USA');
```

# Prepared statements

If MySQL server executes a prepared statement, it does not need to fully parse the query. It will simply use the value assigned in the placeholder.

```mysql
SET @stmt = 'SELECT * FROM tbl';
PREPARE qry FROM @stmt;
EXECUTE qry;
DEALLOCATE PREPARE qry;
```
In the above example, assume that the table name tbl does not exists. Then we have the error ERROR 1146 (42S02): Table 'currentdb.tbl' doesn't exist. Note that we have the error in the prepare stage, not in the execute stage. If there is an error in the prepare stage, we cannot do the execute and deallocate prepare statements.


```mysql
SET @stmt = 'SELECT x, y FROM tbl WHERE x = ?';           # ? is a placeholder.
PREPARE qry FROM @stmt;
SET @x_val = 5; EXECUTE qry USING @x_val;
SET @x_val = 7; EXECUTE qry USING @x_val;
DEALLOCATE PREPARE qry;
```

An example from https://www.mysqltutorial.org/

```mysql
SET @schema = 'classicmodels';
SET @pattern = 'o%';
SELECT CONCAT('DROP TABLE ', GROUP_CONCAT(CONCAT(@schema, '.', TABLE_NAME)), ';')
INTO @droplike
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_SCHEMA = @schema AND TABLE_NAME LIKE @pattern;

SELECT @droplike;
# DROP TABLE classicmodels.offices,classicmodels.orderdetails,classicmodels.orders;

PREPARE stmt FROM @droplike;
EXECUTE stmt;
DEALLOCATE PREPARE stmt;
```

# Procedure

Example:

```mysql
DELIMITER //

CREATE PROCEDURE max_city_pop(IN country_code CHAR(3), OUT city_name CHAR(35), OUT pop INT)
BEGIN
  SELECT IFNULL(MAX(Population),0) INTO pop FROM world.city 
  WHERE CountryCode = country_code;
  
  SELECT IF(MAX(Name) IS NULL, 'Unknown', Name) INTO city_name FROM world.city 
  WHERE CountryCode = country_code AND Population = pop;
END

DELIMITER ;

CALL max_city_pop('KOR', @cityname, @maxpop);
SELECT @cityname, @maxpop;
```

Example from https://www.mysqltutorial.org/

```mysql
DELIMITER //

CREATE PROCEDURE check_table_exists(IN table_name VARCHAR(100), OUT table_exists TINYINT(1))
BEGIN
    DECLARE CONTINUE HANDLER FOR 1146 SET @err = 1;
    SET @err = 0;
    SET @table_name = table_name;
    SET @query = CONCAT('SELECT 1 FROM ', @table_name, ';');
    PREPARE stmt FROM @query;
    SELECT IF(@err = 1, 0, 1) INTO table_exists;
    IF(@err=0) THEN
        DEALLOCATE PREPARE stmt;
    END IF;
END //

CALL check_table_exists('my_tbl', @table_exists);
SELECT @table_exists;
```

Note that in the above example we don't use an EXECUTE statement. It is because we will have an error in the PREPARE stage when table_name does not exist.

# SIGNAL

In a stored function, procedure, or trigger,

```mysql
IF ... THEN
    SIGNAL SQLSTATE 'state_value' SET MYSQL_ERRNO = err_no, MESSAGE_TEXT = 'msg';
END IF;
```